Revit 2026 API

# AXMImportOptions(AXMImportOptions) Constructor

---

Constructs a new instance of AXMImportOptions as a copy of the provided import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AXMImportOptions(
	AXMImportOptions option
)
```
```vb
Public Sub New (
	option As AXMImportOptions
)
```
```cpp
public:
AXMImportOptions(
	AXMImportOptions^ option
)
```
```fsharp
new :
        option : AXMImportOptions -> AXMImportOptions
```

#### Parameters

option AXMImportOptions
     The AXM import options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AXMImportOptions Class

AXMImportOptions Overload

Autodesk.Revit.DB Namespace